guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32-s-n8d16-ssd1683-4.2_副本6.6/esp32-s-n8d16-ssd1683-4.2.cc
    void InitializeTimers() {
        esp_timer_create_args_t battery_timer_args = {
            .callback = &BatteryTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "battery_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&battery_timer_args, &battery_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(battery_timer_, 1000 * 1000));

        esp_timer_create_args_t refresh_timer_args = {
            .callback = &RefreshTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "refresh_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&refresh_timer_args, &refresh_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(refresh_timer_, DISPLAY_REFRESH_INTERVAL_US));

        // Heartbeat timer - 10 minutes
        esp_timer_create_args_t heartbeat_timer_args = {
            .callback = &HeartbeatTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "heartbeat_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&heartbeat_timer_args, &heartbeat_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(heartbeat_timer_, 10ULL * 60ULL * 1000ULL * 1000ULL)); // 10 minutes

        // Live mode timer - 5 seconds (not started by default)
        esp_timer_create_args_t live_mode_timer_args = {
            .callback = &LiveModeTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "live_mode_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&live_mode_timer_args, &live_mode_timer_));
    }

    void StartLiveModeTimer() {
        if (esp_timer_is_active(live_mode_timer_)) {
            esp_timer_stop(live_mode_timer_);
        }
        ESP_LOGI(TAG, "[LIVE MODE] Starting live mode timer (5 seconds)");
        ESP_ERROR_CHECK(esp_timer_start_periodic(live_mode_timer_, 5ULL * 1000ULL * 1000ULL)); // 5 seconds
    }

    void StopLiveModeTimer() {
        if (esp_timer_is_active(live_mode_timer_)) {
            ESP_LOGI(TAG, "[LIVE MODE] Stopping live mode timer");
            esp_timer_stop(live_mode_timer_);
        }
    }



    int ReadBatteryVoltage() {
        int adc_raw = 0;
        long long sum = 0;
        int voltage = 0;
        for (int i = 0; i < 10; i++) {
            ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle_, BATTERY_ADC_CHANNEL, &adc_raw));
            sum += adc_raw;
        }
        adc_raw = sum / 10;

        if (adc_calibrated_) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_handle_, adc_raw, &voltage));
        }

        return voltage * 3;
    }

    int CalculateBatteryPercentage(int voltage) {
        if (!adc_calibrated_ || voltage <= 0) {
            return -1;
        }

        const int min_voltage = 3000;
        const int max_voltage = 4200;

        if (voltage < min_voltage) {
            return 0;
        } else if (voltage > max_voltage) {
            return 100;
        } else {
            return (voltage - min_voltage) * 100 / (max_voltage - min_voltage);
        }
    }

    std::string GetRegistrationCode() {
        nvs_handle_t nvs_handle;
        esp_err_t err = nvs_open("storage", NVS_READONLY, &nvs_handle);
        if (err != ESP_OK) {
            return "N/A";
        }

        char reg_code[32] = {0};
        size_t len = sizeof(reg_code);
        err = nvs_get_str(nvs_handle, "registration_code", reg_code, &len);
        nvs_close(nvs_handle);

        if (err != ESP_OK) {
            return "N/A";
        }

        return std::string(reg_code);
    }

    void ShowWifiConfigScreen() {
        std::string reg_code = GetRegistrationCode();
        display_->showSetupScreen("XIAOZHI_XXXX", reg_code.c_str());
    }

public:
    Esp32SN8d16Ssd168342()
        : boot_button_(BOOT_BUTTON_GPIO, true, BOOT_BUTTON_HOLD_MS),
          ai_button_(AI_BUTTON_GPIO, false),  // AI 按钮是低电平有效
          volume_up_button_(VOLUME_UP_BUTTON_GPIO, true),
          volume_down_button_(VOLUME_DOWN_BUTTON_GPIO, true),
          last_battery_voltage_(0),
          last_battery_percentage_(-1),
          wifi_connected_(false),
          in_deep_sleep_(false),
          wakeup_fetch_done_(false),
          wakeup_start_chat_(false) {
        ESP_LOGI(TAG, "Initializing ESP32-S-N8D16-SSD1683-4.2 Board");

        // 先检测唤醒原因，确定是否从深度睡眠唤醒
        esp_sleep_wakeup_cause_t wakeup_cause = esp_sleep_get_wakeup_cause();
        const char* wakeup_name = "UNKNOWN";
        switch(wakeup_cause) {
            case ESP_SLEEP_WAKEUP_UNDEFINED: wakeup_name = "UNDEFINED"; break;
            case ESP_SLEEP_WAKEUP_EXT0: wakeup_name = "EXT0"; break;
            case ESP_SLEEP_WAKEUP_EXT1: wakeup_name = "EXT1"; break;
            case ESP_SLEEP_WAKEUP_TIMER: wakeup_name = "TIMER"; break;
            case ESP_SLEEP_WAKEUP_GPIO: wakeup_name = "GPIO"; break;
            default: wakeup_name = "OTHER"; break;
        }
        ESP_LOGI(TAG, "[RUNTIME] Wakeup cause: %d (%s)", wakeup_cause, wakeup_name);
        
        // 使用局部变量保存唤醒状态，避免被过早修改
        bool is_wake_from_deep_sleep = (wakeup_cause == ESP_SLEEP_WAKEUP_EXT0 || 
                                        wakeup_cause == ESP_SLEEP_WAKEUP_EXT1 || 
                                        wakeup_cause == ESP_SLEEP_WAKEUP_TIMER);
        
        if (is_wake_from_deep_sleep) {
            in_deep_sleep_ = true;
            ESP_LOGI(TAG, "[RUNTIME] Woke from deep sleep");
        } else {
            in_deep_sleep_ = false;
            ESP_LOGI(TAG, "[RUNTIME] First boot");
        }
        
        InitializeI2c();
        InitializeButtons();
        InitializeTools();
        InitializeDisplay();
        InitializeBatteryAdc();
        InitializeTimers();

        UpdateBatteryStatus();

