guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32-s-n8d16-ssd1683-4.2_副本6.6/esp32-s-n8d16-ssd1683-4.2.cc
        // 设置网络事件回调
        SetNetworkEventCallback([this](NetworkEvent event, const std::string& data) {
            ESP_LOGI(TAG, "[RUNTIME] SetNetworkEventCallback called, event=%d", (int)event);
            HandleNetworkEventCallback(event, data);
        });

        // 根据唤醒原因执行不同逻辑
        if (is_wake_from_deep_sleep) {
            ESP_LOGI(TAG, "[RUNTIME] Woke from deep sleep, calling WakeFromDeepSleep...");
            wakeup_start_chat_ = true;  // 设置标志，表示唤醒后需要启动对话
            WakeFromDeepSleep();
        } else {
            ESP_LOGI(TAG, "[RUNTIME] First boot, showing initial screen");
            display_->showAiChatStatus("IDLE", "INITIALIZING...");
        }
        
        // 检查 WiFi 是否已连接（防止回调设置前已连接）
        ESP_LOGI(TAG, "[INKSIGHT] Scheduling CheckAndInitializeInksight...");
        Application::GetInstance().Schedule([this, is_wake_from_deep_sleep]() {
            ESP_LOGI(TAG, "[INKSIGHT] CheckAndInitializeInksight scheduled task running, is_wake=%d", is_wake_from_deep_sleep);
            CheckAndInitializeInksight(is_wake_from_deep_sleep);
        });
    }

    ~Esp32SN8d16Ssd168342() {
        esp_timer_stop(battery_timer_);
        esp_timer_delete(battery_timer_);
        esp_timer_stop(refresh_timer_);
        esp_timer_delete(refresh_timer_);

        ESP_ERROR_CHECK(adc_oneshot_del_unit(adc1_handle_));

        if (adc_calibrated_) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
            ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(adc1_cali_handle_));
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
            ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(adc1_cali_handle_));
#endif
        }
    }

    virtual AudioCodec* GetAudioCodec() override {
        static Es8311AudioCodec audio_codec(
            i2c_bus_, I2C_NUM_0, AUDIO_INPUT_SAMPLE_RATE, AUDIO_OUTPUT_SAMPLE_RATE,
            AUDIO_I2S_GPIO_MCLK, AUDIO_I2S_GPIO_BCLK, AUDIO_I2S_GPIO_WS, AUDIO_I2S_GPIO_DOUT,
            AUDIO_I2S_GPIO_DIN, AUDIO_CODEC_PA_PIN, AUDIO_CODEC_ES8311_ADDR);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override { return display_; }

    int GetBatteryVoltage() {
        return last_battery_voltage_;
    }
    
    bool IsWakeFromDeepSleep() override { return in_deep_sleep_; }
    bool IsWakeupFetchDone() const { return wakeup_fetch_done_; }
    
    // 检查唤醒后是否需要启动对话，并清除标志
    bool CheckAndClearWakeupStartChat() {
        bool result = wakeup_start_chat_;
        wakeup_start_chat_ = false;
        return result;
    }
    
    void FetchImageAfterWake() {
        if (!wakeup_fetch_done_) {
            wakeup_fetch_done_ = true;
            display_->FetchInksightImage();
            ESP_LOGI(TAG, "[INKSIGHT] Wake from deep sleep, image fetched after chat");
        }
    }
    
    void OnDeviceIdle() override {
        if (!wakeup_fetch_done_) {
            ESP_LOGI(TAG, "[INKSIGHT] Wake from deep sleep, fetching image after chat ended");
            display_->SetSuppressAutoImageFetch(false);  // 重新启用自动获取图片
            wakeup_fetch_done_ = true;
            display_->FetchInksightImage();
        }
    }
    
    virtual bool GetBatteryLevel(int& level, bool& charging, bool& discharging) override {
        level = last_battery_percentage_;
        charging = false;
        discharging = true;
        return true;
    }

    void EnterDeepSleep() {
        ESP_LOGI(TAG, "[RUNTIME] Entering deep sleep...");
        
        // 检查 always_active 模式
        if (display_->IsAlwaysActive()) {
            ESP_LOGI(TAG, "[RUNTIME] Always active mode is ON, skipping deep sleep");
            return;
        }
        
        // 检查设备状态，如果正在活跃对话（listening/speaking），不进入休眠
        DeviceState state = Application::GetInstance().GetDeviceState();
        ESP_LOGI(TAG, "[RUNTIME] Current device state: %d", state);
        if (state == kDeviceStateListening || state == kDeviceStateSpeaking) {
            ESP_LOGI(TAG, "[RUNTIME] Device is active (state=%d), skipping deep sleep", state);
            return;
        }
        
        display_->EPD_Sleep();
        in_deep_sleep_ = true;
        
        // 获取睡眠时长（从display获取）
        int sleep_minutes = display_->GetSleepMinutes();
        uint64_t sleep_us = (uint64_t)sleep_minutes * 60 * 1000 * 1000;
        ESP_LOGI(TAG, "[RUNTIME] Deep sleep duration: %d minutes (%llu us)", sleep_minutes, sleep_us);
        
        // 断开 WiFi 连接前，先等待一下让其他任务完成
        vTaskDelay(pdMS_TO_TICKS(100));
        
        // 断开 WiFi 连接
        esp_wifi_disconnect();
        esp_wifi_stop();
        
        // 等待 WiFi 完全停止
        vTaskDelay(pdMS_TO_TICKS(200));
        
        // 关键：保存 WiFi 配置到 RTC 内存，实现快速恢复
        esp_err_t err = esp_wifi_restore();
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "[RUNTIME] WiFi config saved to RTC for quick restore");
        } else {
            ESP_LOGI(TAG, "[RUNTIME] WiFi restore result: %s (will need full reconnect)", esp_err_to_name(err));
        }
        
        // 关键：禁用所有唤醒源（清除之前的配置）
        esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
        
        // 配置RTC外设电源域，确保唤醒有效
        esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
        
        // 配置AI按钮GPIO为输入模式，启用内部上拉
        gpio_config_t ai_button_config = {};
        ai_button_config.pin_bit_mask = (1ULL << AI_BUTTON_GPIO);
        ai_button_config.mode = GPIO_MODE_INPUT;
        ai_button_config.pull_up_en = GPIO_PULLUP_ENABLE;
        ai_button_config.pull_down_en = GPIO_PULLDOWN_DISABLE;
        ai_button_config.intr_type = GPIO_INTR_DISABLE;
        gpio_config(&ai_button_config);
        
        // 读取AI按钮状态，检查是否被按下
        int ai_button_state = gpio_get_level((gpio_num_t)AI_BUTTON_GPIO);
        ESP_LOGI(TAG, "[RUNTIME] AI button state before sleep: %s (GPIO%d)", 
                 ai_button_state ? "HIGH" : "LOW", AI_BUTTON_GPIO);
        
        // 如果按钮被按下（LOW），不进入深度睡眠，避免立即被唤醒
        if (!ai_button_state) {
            ESP_LOGW(TAG, "[RUNTIME] AI button is pressed, skipping deep sleep");
            in_deep_sleep_ = false;
            return;
        }
        
        // 配置AI按钮GPIO为EXT1低电平唤醒
        ESP_ERROR_CHECK(rtc_gpio_init((gpio_num_t)AI_BUTTON_GPIO));
        ESP_ERROR_CHECK(rtc_gpio_pullup_en((gpio_num_t)AI_BUTTON_GPIO));  // 启用上拉
        ESP_ERROR_CHECK(rtc_gpio_pulldown_dis((gpio_num_t)AI_BUTTON_GPIO));  // 禁用下拉
        ESP_ERROR_CHECK(esp_sleep_enable_ext1_wakeup(1ULL << AI_BUTTON_GPIO, ESP_EXT1_WAKEUP_ANY_LOW)); // 低电平唤醒
        ESP_LOGI(TAG, "[RUNTIME] AI button wakeup enabled (GPIO%d, EXT1, ANY LOW)", AI_BUTTON_GPIO);
        
        // 配置定时器唤醒
        esp_sleep_enable_timer_wakeup(sleep_us);
        ESP_LOGI(TAG, "[RUNTIME] Timer wakeup enabled");
        ESP_LOGI(TAG, "[RUNTIME] Now going to deep sleep now...");
        esp_deep_sleep_start();
    }
};

DECLARE_BOARD(Esp32SN8d16Ssd168342);